{
  "irVersion": "6",
  "producerName": "pytorch",
  "producerVersion": "2.7.0",
  "graph": {
    "node": [
      {
        "input": [
          "data_input",
          "onnx::Conv_497",
          "onnx::Conv_498"
        ],
        "output": [
          "/conv1/Conv_output_0"
        ],
        "name": "/conv1/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "7",
              "7"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "3",
              "3",
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/conv1/Conv_output_0"
        ],
        "output": [
          "/relu/Relu_output_0"
        ],
        "name": "/relu/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/relu/Relu_output_0"
        ],
        "output": [
          "/maxpool/MaxPool_output_0"
        ],
        "name": "/maxpool/MaxPool",
        "opType": "MaxPool",
        "attribute": [
          {
            "name": "ceil_mode",
            "i": "0",
            "type": "INT"
          },
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/maxpool/MaxPool_output_0",
          "onnx::Conv_500",
          "onnx::Conv_501"
        ],
        "output": [
          "/layer1/layer1.0/conv1/Conv_output_0"
        ],
        "name": "/layer1/layer1.0/conv1/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer1/layer1.0/conv1/Conv_output_0"
        ],
        "output": [
          "/layer1/layer1.0/relu/Relu_output_0"
        ],
        "name": "/layer1/layer1.0/relu/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer1/layer1.0/relu/Relu_output_0",
          "onnx::Conv_503",
          "onnx::Conv_504"
        ],
        "output": [
          "/layer1/layer1.0/conv2/Conv_output_0"
        ],
        "name": "/layer1/layer1.0/conv2/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer1/layer1.0/conv2/Conv_output_0"
        ],
        "output": [
          "/layer1/layer1.0/relu_1/Relu_output_0"
        ],
        "name": "/layer1/layer1.0/relu_1/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer1/layer1.0/relu_1/Relu_output_0",
          "onnx::Conv_506",
          "onnx::Conv_507"
        ],
        "output": [
          "/layer1/layer1.0/conv3/Conv_output_0"
        ],
        "name": "/layer1/layer1.0/conv3/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/maxpool/MaxPool_output_0",
          "onnx::Conv_509",
          "onnx::Conv_510"
        ],
        "output": [
          "/layer1/layer1.0/downsample/downsample.0/Conv_output_0"
        ],
        "name": "/layer1/layer1.0/downsample/downsample.0/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer1/layer1.0/conv3/Conv_output_0",
          "/layer1/layer1.0/downsample/downsample.0/Conv_output_0"
        ],
        "output": [
          "/layer1/layer1.0/Add_output_0"
        ],
        "name": "/layer1/layer1.0/Add",
        "opType": "Add"
      },
      {
        "input": [
          "/layer1/layer1.0/Add_output_0"
        ],
        "output": [
          "/layer1/layer1.0/relu_2/Relu_output_0"
        ],
        "name": "/layer1/layer1.0/relu_2/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer1/layer1.0/relu_2/Relu_output_0",
          "onnx::Conv_512",
          "onnx::Conv_513"
        ],
        "output": [
          "/layer1/layer1.1/conv1/Conv_output_0"
        ],
        "name": "/layer1/layer1.1/conv1/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer1/layer1.1/conv1/Conv_output_0"
        ],
        "output": [
          "/layer1/layer1.1/relu/Relu_output_0"
        ],
        "name": "/layer1/layer1.1/relu/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer1/layer1.1/relu/Relu_output_0",
          "onnx::Conv_515",
          "onnx::Conv_516"
        ],
        "output": [
          "/layer1/layer1.1/conv2/Conv_output_0"
        ],
        "name": "/layer1/layer1.1/conv2/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer1/layer1.1/conv2/Conv_output_0"
        ],
        "output": [
          "/layer1/layer1.1/relu_1/Relu_output_0"
        ],
        "name": "/layer1/layer1.1/relu_1/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer1/layer1.1/relu_1/Relu_output_0",
          "onnx::Conv_518",
          "onnx::Conv_519"
        ],
        "output": [
          "/layer1/layer1.1/conv3/Conv_output_0"
        ],
        "name": "/layer1/layer1.1/conv3/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer1/layer1.1/conv3/Conv_output_0",
          "/layer1/layer1.0/relu_2/Relu_output_0"
        ],
        "output": [
          "/layer1/layer1.1/Add_output_0"
        ],
        "name": "/layer1/layer1.1/Add",
        "opType": "Add"
      },
      {
        "input": [
          "/layer1/layer1.1/Add_output_0"
        ],
        "output": [
          "/layer1/layer1.1/relu_2/Relu_output_0"
        ],
        "name": "/layer1/layer1.1/relu_2/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer1/layer1.1/relu_2/Relu_output_0",
          "onnx::Conv_521",
          "onnx::Conv_522"
        ],
        "output": [
          "/layer1/layer1.2/conv1/Conv_output_0"
        ],
        "name": "/layer1/layer1.2/conv1/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer1/layer1.2/conv1/Conv_output_0"
        ],
        "output": [
          "/layer1/layer1.2/relu/Relu_output_0"
        ],
        "name": "/layer1/layer1.2/relu/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer1/layer1.2/relu/Relu_output_0",
          "onnx::Conv_524",
          "onnx::Conv_525"
        ],
        "output": [
          "/layer1/layer1.2/conv2/Conv_output_0"
        ],
        "name": "/layer1/layer1.2/conv2/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer1/layer1.2/conv2/Conv_output_0"
        ],
        "output": [
          "/layer1/layer1.2/relu_1/Relu_output_0"
        ],
        "name": "/layer1/layer1.2/relu_1/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer1/layer1.2/relu_1/Relu_output_0",
          "onnx::Conv_527",
          "onnx::Conv_528"
        ],
        "output": [
          "/layer1/layer1.2/conv3/Conv_output_0"
        ],
        "name": "/layer1/layer1.2/conv3/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer1/layer1.2/conv3/Conv_output_0",
          "/layer1/layer1.1/relu_2/Relu_output_0"
        ],
        "output": [
          "/layer1/layer1.2/Add_output_0"
        ],
        "name": "/layer1/layer1.2/Add",
        "opType": "Add"
      },
      {
        "input": [
          "/layer1/layer1.2/Add_output_0"
        ],
        "output": [
          "/layer1/layer1.2/relu_2/Relu_output_0"
        ],
        "name": "/layer1/layer1.2/relu_2/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer1/layer1.2/relu_2/Relu_output_0",
          "onnx::Conv_530",
          "onnx::Conv_531"
        ],
        "output": [
          "/layer2/layer2.0/conv1/Conv_output_0"
        ],
        "name": "/layer2/layer2.0/conv1/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer2/layer2.0/conv1/Conv_output_0"
        ],
        "output": [
          "/layer2/layer2.0/relu/Relu_output_0"
        ],
        "name": "/layer2/layer2.0/relu/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer2/layer2.0/relu/Relu_output_0",
          "onnx::Conv_533",
          "onnx::Conv_534"
        ],
        "output": [
          "/layer2/layer2.0/conv2/Conv_output_0"
        ],
        "name": "/layer2/layer2.0/conv2/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer2/layer2.0/conv2/Conv_output_0"
        ],
        "output": [
          "/layer2/layer2.0/relu_1/Relu_output_0"
        ],
        "name": "/layer2/layer2.0/relu_1/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer2/layer2.0/relu_1/Relu_output_0",
          "onnx::Conv_536",
          "onnx::Conv_537"
        ],
        "output": [
          "/layer2/layer2.0/conv3/Conv_output_0"
        ],
        "name": "/layer2/layer2.0/conv3/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer1/layer1.2/relu_2/Relu_output_0",
          "onnx::Conv_539",
          "onnx::Conv_540"
        ],
        "output": [
          "/layer2/layer2.0/downsample/downsample.0/Conv_output_0"
        ],
        "name": "/layer2/layer2.0/downsample/downsample.0/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer2/layer2.0/conv3/Conv_output_0",
          "/layer2/layer2.0/downsample/downsample.0/Conv_output_0"
        ],
        "output": [
          "/layer2/layer2.0/Add_output_0"
        ],
        "name": "/layer2/layer2.0/Add",
        "opType": "Add"
      },
      {
        "input": [
          "/layer2/layer2.0/Add_output_0"
        ],
        "output": [
          "/layer2/layer2.0/relu_2/Relu_output_0"
        ],
        "name": "/layer2/layer2.0/relu_2/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer2/layer2.0/relu_2/Relu_output_0",
          "onnx::Conv_542",
          "onnx::Conv_543"
        ],
        "output": [
          "/layer2/layer2.1/conv1/Conv_output_0"
        ],
        "name": "/layer2/layer2.1/conv1/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer2/layer2.1/conv1/Conv_output_0"
        ],
        "output": [
          "/layer2/layer2.1/relu/Relu_output_0"
        ],
        "name": "/layer2/layer2.1/relu/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer2/layer2.1/relu/Relu_output_0",
          "onnx::Conv_545",
          "onnx::Conv_546"
        ],
        "output": [
          "/layer2/layer2.1/conv2/Conv_output_0"
        ],
        "name": "/layer2/layer2.1/conv2/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer2/layer2.1/conv2/Conv_output_0"
        ],
        "output": [
          "/layer2/layer2.1/relu_1/Relu_output_0"
        ],
        "name": "/layer2/layer2.1/relu_1/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer2/layer2.1/relu_1/Relu_output_0",
          "onnx::Conv_548",
          "onnx::Conv_549"
        ],
        "output": [
          "/layer2/layer2.1/conv3/Conv_output_0"
        ],
        "name": "/layer2/layer2.1/conv3/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer2/layer2.1/conv3/Conv_output_0",
          "/layer2/layer2.0/relu_2/Relu_output_0"
        ],
        "output": [
          "/layer2/layer2.1/Add_output_0"
        ],
        "name": "/layer2/layer2.1/Add",
        "opType": "Add"
      },
      {
        "input": [
          "/layer2/layer2.1/Add_output_0"
        ],
        "output": [
          "/layer2/layer2.1/relu_2/Relu_output_0"
        ],
        "name": "/layer2/layer2.1/relu_2/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer2/layer2.1/relu_2/Relu_output_0",
          "onnx::Conv_551",
          "onnx::Conv_552"
        ],
        "output": [
          "/layer2/layer2.2/conv1/Conv_output_0"
        ],
        "name": "/layer2/layer2.2/conv1/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer2/layer2.2/conv1/Conv_output_0"
        ],
        "output": [
          "/layer2/layer2.2/relu/Relu_output_0"
        ],
        "name": "/layer2/layer2.2/relu/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer2/layer2.2/relu/Relu_output_0",
          "onnx::Conv_554",
          "onnx::Conv_555"
        ],
        "output": [
          "/layer2/layer2.2/conv2/Conv_output_0"
        ],
        "name": "/layer2/layer2.2/conv2/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer2/layer2.2/conv2/Conv_output_0"
        ],
        "output": [
          "/layer2/layer2.2/relu_1/Relu_output_0"
        ],
        "name": "/layer2/layer2.2/relu_1/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer2/layer2.2/relu_1/Relu_output_0",
          "onnx::Conv_557",
          "onnx::Conv_558"
        ],
        "output": [
          "/layer2/layer2.2/conv3/Conv_output_0"
        ],
        "name": "/layer2/layer2.2/conv3/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer2/layer2.2/conv3/Conv_output_0",
          "/layer2/layer2.1/relu_2/Relu_output_0"
        ],
        "output": [
          "/layer2/layer2.2/Add_output_0"
        ],
        "name": "/layer2/layer2.2/Add",
        "opType": "Add"
      },
      {
        "input": [
          "/layer2/layer2.2/Add_output_0"
        ],
        "output": [
          "/layer2/layer2.2/relu_2/Relu_output_0"
        ],
        "name": "/layer2/layer2.2/relu_2/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer2/layer2.2/relu_2/Relu_output_0",
          "onnx::Conv_560",
          "onnx::Conv_561"
        ],
        "output": [
          "/layer2/layer2.3/conv1/Conv_output_0"
        ],
        "name": "/layer2/layer2.3/conv1/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer2/layer2.3/conv1/Conv_output_0"
        ],
        "output": [
          "/layer2/layer2.3/relu/Relu_output_0"
        ],
        "name": "/layer2/layer2.3/relu/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer2/layer2.3/relu/Relu_output_0",
          "onnx::Conv_563",
          "onnx::Conv_564"
        ],
        "output": [
          "/layer2/layer2.3/conv2/Conv_output_0"
        ],
        "name": "/layer2/layer2.3/conv2/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer2/layer2.3/conv2/Conv_output_0"
        ],
        "output": [
          "/layer2/layer2.3/relu_1/Relu_output_0"
        ],
        "name": "/layer2/layer2.3/relu_1/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer2/layer2.3/relu_1/Relu_output_0",
          "onnx::Conv_566",
          "onnx::Conv_567"
        ],
        "output": [
          "/layer2/layer2.3/conv3/Conv_output_0"
        ],
        "name": "/layer2/layer2.3/conv3/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer2/layer2.3/conv3/Conv_output_0",
          "/layer2/layer2.2/relu_2/Relu_output_0"
        ],
        "output": [
          "/layer2/layer2.3/Add_output_0"
        ],
        "name": "/layer2/layer2.3/Add",
        "opType": "Add"
      },
      {
        "input": [
          "/layer2/layer2.3/Add_output_0"
        ],
        "output": [
          "/layer2/layer2.3/relu_2/Relu_output_0"
        ],
        "name": "/layer2/layer2.3/relu_2/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer2/layer2.3/relu_2/Relu_output_0",
          "onnx::Conv_569",
          "onnx::Conv_570"
        ],
        "output": [
          "/layer3/layer3.0/conv1/Conv_output_0"
        ],
        "name": "/layer3/layer3.0/conv1/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer3/layer3.0/conv1/Conv_output_0"
        ],
        "output": [
          "/layer3/layer3.0/relu/Relu_output_0"
        ],
        "name": "/layer3/layer3.0/relu/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer3/layer3.0/relu/Relu_output_0",
          "onnx::Conv_572",
          "onnx::Conv_573"
        ],
        "output": [
          "/layer3/layer3.0/conv2/Conv_output_0"
        ],
        "name": "/layer3/layer3.0/conv2/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer3/layer3.0/conv2/Conv_output_0"
        ],
        "output": [
          "/layer3/layer3.0/relu_1/Relu_output_0"
        ],
        "name": "/layer3/layer3.0/relu_1/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer3/layer3.0/relu_1/Relu_output_0",
          "onnx::Conv_575",
          "onnx::Conv_576"
        ],
        "output": [
          "/layer3/layer3.0/conv3/Conv_output_0"
        ],
        "name": "/layer3/layer3.0/conv3/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer2/layer2.3/relu_2/Relu_output_0",
          "onnx::Conv_578",
          "onnx::Conv_579"
        ],
        "output": [
          "/layer3/layer3.0/downsample/downsample.0/Conv_output_0"
        ],
        "name": "/layer3/layer3.0/downsample/downsample.0/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer3/layer3.0/conv3/Conv_output_0",
          "/layer3/layer3.0/downsample/downsample.0/Conv_output_0"
        ],
        "output": [
          "/layer3/layer3.0/Add_output_0"
        ],
        "name": "/layer3/layer3.0/Add",
        "opType": "Add"
      },
      {
        "input": [
          "/layer3/layer3.0/Add_output_0"
        ],
        "output": [
          "/layer3/layer3.0/relu_2/Relu_output_0"
        ],
        "name": "/layer3/layer3.0/relu_2/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer3/layer3.0/relu_2/Relu_output_0",
          "onnx::Conv_581",
          "onnx::Conv_582"
        ],
        "output": [
          "/layer3/layer3.1/conv1/Conv_output_0"
        ],
        "name": "/layer3/layer3.1/conv1/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer3/layer3.1/conv1/Conv_output_0"
        ],
        "output": [
          "/layer3/layer3.1/relu/Relu_output_0"
        ],
        "name": "/layer3/layer3.1/relu/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer3/layer3.1/relu/Relu_output_0",
          "onnx::Conv_584",
          "onnx::Conv_585"
        ],
        "output": [
          "/layer3/layer3.1/conv2/Conv_output_0"
        ],
        "name": "/layer3/layer3.1/conv2/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer3/layer3.1/conv2/Conv_output_0"
        ],
        "output": [
          "/layer3/layer3.1/relu_1/Relu_output_0"
        ],
        "name": "/layer3/layer3.1/relu_1/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer3/layer3.1/relu_1/Relu_output_0",
          "onnx::Conv_587",
          "onnx::Conv_588"
        ],
        "output": [
          "/layer3/layer3.1/conv3/Conv_output_0"
        ],
        "name": "/layer3/layer3.1/conv3/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer3/layer3.1/conv3/Conv_output_0",
          "/layer3/layer3.0/relu_2/Relu_output_0"
        ],
        "output": [
          "/layer3/layer3.1/Add_output_0"
        ],
        "name": "/layer3/layer3.1/Add",
        "opType": "Add"
      },
      {
        "input": [
          "/layer3/layer3.1/Add_output_0"
        ],
        "output": [
          "/layer3/layer3.1/relu_2/Relu_output_0"
        ],
        "name": "/layer3/layer3.1/relu_2/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer3/layer3.1/relu_2/Relu_output_0",
          "onnx::Conv_590",
          "onnx::Conv_591"
        ],
        "output": [
          "/layer3/layer3.2/conv1/Conv_output_0"
        ],
        "name": "/layer3/layer3.2/conv1/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer3/layer3.2/conv1/Conv_output_0"
        ],
        "output": [
          "/layer3/layer3.2/relu/Relu_output_0"
        ],
        "name": "/layer3/layer3.2/relu/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer3/layer3.2/relu/Relu_output_0",
          "onnx::Conv_593",
          "onnx::Conv_594"
        ],
        "output": [
          "/layer3/layer3.2/conv2/Conv_output_0"
        ],
        "name": "/layer3/layer3.2/conv2/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer3/layer3.2/conv2/Conv_output_0"
        ],
        "output": [
          "/layer3/layer3.2/relu_1/Relu_output_0"
        ],
        "name": "/layer3/layer3.2/relu_1/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer3/layer3.2/relu_1/Relu_output_0",
          "onnx::Conv_596",
          "onnx::Conv_597"
        ],
        "output": [
          "/layer3/layer3.2/conv3/Conv_output_0"
        ],
        "name": "/layer3/layer3.2/conv3/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "/layer3/layer3.2/conv3/Conv_output_0",
          "/layer3/layer3.1/relu_2/Relu_output_0"
        ],
        "output": [
          "/layer3/layer3.2/Add_output_0"
        ],
        "name": "/layer3/layer3.2/Add",
        "opType": "Add"
      },
      {
        "input": [
          "/layer3/layer3.2/Add_output_0"
        ],
        "output": [
          "/layer3/layer3.2/relu_2/Relu_output_0"
        ],
        "name": "/layer3/layer3.2/relu_2/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/layer3/layer3.2/relu_2/Relu_output_0",
          "onnx::Conv_599",
          "onnx::Conv_600"
        ],
        "output": [
          "/layer3/layer3.3/conv1/Conv_output_0"
        ],
        "name": "/layer3/layer3.3/conv1/Conv",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
